#!/usr/bin/env ruby

BEGIN {
  hh = {
    "不當-ふたう"                   => "ふ|たう"                , # だ、しかし
    "世界-せかい"                   => "せ|かい"                , # ぢやあ、
    "乾燥-ひから"                   => "ひか|ら"                , # びたる
    "亡失-うしな"                   => "うし|な"                , # はれたりとて、
    "仔細-しさい"                   => "し|さい"                , # のあるのでは
    "他有-ほかあ"                   => "ほか|あ"                , # りやあ
    "住家-すまゐ"                   => "すま|ゐ"                , # をでも、
    "依頼-たのみ"                   => "たの|み"                , # によりて
    "侮蔑-さげす"                   => "さげ|す"                , # みながら、
    "傍目-わきめ"                   => "わき|め"                , # もふらずにせつせと
    "冷悧-りこう"                   => "り|こう"                , # でも
    "古渡-こわた"                   => "こ|わた"                , # りの
    "外妾-めかけ"                   => "めか|け"                , # には
    "姿勢-すがた"                   => "すが|た"                , # はまだ
    "安堵-おちつ"                   => "おち|つ"                , # いたのでございます。
    "定例-さだめ"                   => "さだ|め"                , # あつて、
    "居辛-ゐづら"                   => "ゐ|づら"                , # くつて
    "幼稚-こども"                   => "こ|ども"                , # にも
    "幽微-かすか"                   => "かす|か"                , # にはあれど
    "幽閑-しづか"                   => "しづ|か"                , # にして、
    "彷徨-まごつ"                   => "まご|つ"                , # かうものなら、
    "復呼-またよ"                   => "また|よ"                , # べども
    "怜悧-りかう"                   => "り|かう"                , # ぢや
    "怠惰-なまけ"                   => "なま|け"                , # たといふのぢやあ
    "恐惶-かしく"                   => "かし|く"                , # まで
    "感想-おもひ"                   => "おも|ひ"                , # に、たゞ
    "手物-てもの"                   => "て|もの"                , # の
    "抗辯-あらが"                   => "あら|が"                , # はんとしけるが、
    "披瀝-ひれき"                   => "ひ|れき"                , # して、
    "擧動-そぶり"                   => "そ|ぶり"                , # ばかりに
    "放肆-はうし"                   => "はう|し"                , # ならしめぬやうに
    "時勢-じせい"                   => "じ|せい"                , # の
    "時雨-しぐれ"                   => "しぐ|れ"                , # はら〳〵と
    "暑熱-あつさ"                   => "あつ|さ"                , # にも、
    "根基-もとひ"                   => "もと|ひ"                , # となりし
    "模樣-もやう"                   => "も|やう"                , # を
    "深創-ふかで"                   => "ふか|で"                , # より、
    "溫和-おとな"                   => "おと|な"                , # しい
    "熟知-なじみ"                   => "なじ|み"                , # にもあらぬ
    "熾盛-さかん"                   => "さか|ん"                , # なれども、
    "爲宜-ためよ"                   => "ため|よ"                , # かれと
    "牙彫-げぼり"                   => "げ|ぼり"                , # の
    "狡猾-かしこ"                   => "かし|こ"                , # さよ！。
    "畫工-ゑかき"                   => "ゑ|かき"                , # には
    "盲目-めくら"                   => "めく|ら"                , # ぢや
    "價値-あたひ　"                 => "あた|ひ　"              , #
    "噴嚏-くしやみ"                 => "くしや|み"              , # を
    "性根-しやうね"                 => "しやう|ね"              , # の
    "爾我-なんぢわ"                 => "なんぢ|わ"              , # が
    "玉露-ぎよくろ"                 => "ぎよく|ろ"              , # の
    "容赦-うつちあ"                 => "うつ|ちあ"              , # つて
    "斜線-すじかひ"                 => "すじ|かひ"              , # に、
    "仁有-なさけあ"                 => "なさけ|あ"              , # るに、
    "十六-じうろく"                 => "じう|ろく"              , # かで、
    "吃驚-びつくり"                 => "びつ|くり"              , # した！。
    "健康-すこやかさ"               => "すこ|やかさ"            , # に
    "右左-みぎひだり"               => "みぎ|ひだり"            , # に
    "婢等-をんなども"               => "をんな|ども"            , # も
    "復忽-またたちま"               => "また|たちま"            , # ち
    "慰安-やすらかさ"               => "やす|らかさ"            , # を
    "懐手-ふところで"               => "ふところ|で"            , # で
    "枕頭-まくらもと"               => "まくら|もと"            , # の
    "瀦水-たまりみづ"               => "たまり|みづ"            , # の
    "玩弄-もてあそび"               => "もて|あそび"            , # に
    "病勢-びやうせい"               => "びやう|せい"            , # の
    "冗談-じやうだん"               => "じやう|だん"            , # を、
    "拉去-ひつちよび"               => "ひつ|ちよび"            , # いて
    "海邊-うみのはた"               => "うみの|はた"            , # でも
    "痴漢-おろかもの"               => "おろか|もの"            , # ならぬ
    "皆誰-みんなだれ"               => "みんな|だれ"            , # だつて
    "伯爵-はくしやく"               => "はく|しやく"            , # のやうな
    "物怖-ものおそろ"               => "もの|おそろ"            , # しくて、
    "獨語-ひとりごと"               => "ひとり|ごと"            , # のやうに
    "申上-まをしあげ"               => "まをし|あげ"            , # ましても
    "對照-うつりあひ"               => "うつり|あひ"            , # といふものは、
    "愈恐-いよ〳〵おそ"             => "いよ〳〵|おそ"          , # れ
    "煩悶-もしやくしや"             => "もしや|くしや"          , # の
    "狼物-おほかみもの"             => "おほかみ|もの"          , # の
    "俊寛-しゆんくわん"             => "しゆん|くわん"          , # くさい
    "勢籠-いきほひこも"             => "いきほひ|こも"          , # りて、
    "狂僧-きちがひばうず"           => "きちがひ|ばうず"        , # になるかそれは
    "宇都宮-みや"                   => "み||や"                 , # から
    "盲目漢-めくら"                 => "め|く|ら"               , # ！、
    "五月雨-さみだれ"               => "さ|み|だれ"             , # の
    "他人樣-ひとさま"               => "ひと|さ|ま"             , # の
    "休暇日-やすみび"               => "やす|み|び"             , # の
    "古薩摩-こさつま"               => "こ|さつ|ま"             , # か
    "大島紬-おほしま"               => "おほ|し|ま"             , # は
    "奈良漬-ならづけ"               => "なら|づ|け"             , # を
    "常綠樹-ときはぎ"               => "とき|は|ぎ"             , # の
    "支那製-しなせい"               => "し|な|せい"             , # の
    "智慧深-ちゑふか"               => "ち|ゑ|ふか"             , # き
    "此方等-こちとら"               => "こ|ち|とら"             , # あ
    "玩弄物-おもちや"               => "お|も|ちや"             , # だ。
    "物數寄-ものずき"               => "も|の|ずき"             , # のやうに
    "必定爲-きつとし"               => "きつ|と|し"             , # てあげるがネ。
    "古九谷-こくたに"               => "こ|くた|に"             , # とありさうなところを
    "不如歸-ほとゝぎす"             => "ほと|ゝぎ|す"           , # の
    "内裏雛-だいりびな"             => "だい|り|びな"           , # の
    "十字星-じうじせい"             => "じう|じ|せい"           , # の
    "十幾歳-じふいくつ"             => "じふ|いく|つ"           , # の
    "彼樣惡-あんなわる"             => "あん|な|わる"           , # い
    "必定譯-きつとわけ"             => "きつ|と|わけ"           , # は
    "戸棚捜-とだなさが"             => "と|だな|さが"           , # し
    "折目高-をりめだか"             => "をり|め|だか"           , # に
    "數年前-すねんぜん"             => "す|ねん|ぜん"           , # に
    "案内乞-あんないこ"             => "あん|ない|こ"           , # ふ
    "澤山仕-たくさんし"             => "たく|さん|し"           , # て
    "煙草一-たばこひと"             => "たば|こ|ひと"           , # つ
    "煙草袋-たばこいれ"             => "たば|こ|いれ"           , # を
    "白牡丹-はくぼたん"             => "はく|ぼ|たん"           , # を
    "白砂糠-しろざたう"             => "しろ|ざ|たう"           , # を
    "眞底詫-しんそこわ"             => "しん|そこ|わ"           , # びる
    "取片付-とりかたづ"             => "とり|かた|づ"           , # けて、
    "奉公住-ほうこうず"             => "ほう|こう|ず"           , # みでも
    "得々出-わざ〳〵で"             => "わざ|〳〵|で"           , # かけて
    "拿破崙-なぽれおん"             => "なぽ|れお|ん"           , # だぞと、
    "日本酒-にほんしゆ"             => "に|ほん|しゆ"           , # でもの、
    "便宜惡-たよりあし"             => "たよ|り|あし"           , # かるべきを
    "些不足-ちつとふそく"           => "ちつと|ふ|そく"         , # な
    "此節柄-このせつがら"           => "この|せつ|がら"         , # の
    "其程思-それほどおも"           => "それ|ほど|おも"         , # つてる
    "傍目訝-よそめいぶか"           => "よそ|め|いぶか"         , # しきまで
    "十一日-じういちにち"           => "じう|いち|にち"         , # になります。
    "伯爵邸-はくしやくてい"         => "はく|しやく|てい"       , # の
    "皆熟睡-みなじゆくすい"         => "みな|じゆく|すい"       , # して
    "此家靜-このいへしづか"         => "この|いへ|しづか"       , # なり。
    "増長致-ぞうちやういた"         => "ぞう|ちやう|いた"       , # します、
    "時時鶉-ときどきうづら"         => "とき|どき|うづら"       , # のやうな
    "吉右衛門-きちゑもん　"         => "き|ち|ゑ|もん　"        , #
    "味噌漉縞-みそこしじま"         => "み|そ|こし|じま"        , # の
    "大方其故-おほかたそれ"         => "おほ|かた|そ|れ"        , # で
    "普通大抵-なみたいてい"         => "な|み|たい|てい"        , # の
    "此際數日-こゝしばらく"         => "こ|ゝ|しば|らく"        , # を
    "今時彼樣-いまどきあゝ"         => "いま|どき|あ|ゝ"        , # いふ
    "修業沙汰-しゆげふざた"         => "しゆ|げふ|ざ|た"        , # なんかは
    "五十六十-ごじうろくじう"       => "ご|じう|ろく|じう"      , # の
    "大士堂前-だいしだうぜん"       => "だい|し|だう|ぜん"      , # に
    "手紙一本-てがみいつぽん"       => "て|がみ|いつ|ぽん"      , # も
    "玉霰銀盤-あられぎんばん"       => "あら|れ|ぎん|ばん"      , # を
    "勸工場品-くわんこうばもの"     => "くわん|こう|ば|もの"    , # に
    "振舞言語-ふるまひものいひ"     => "ふる|まひ|もの|いひ"    , # を
    "成程薄暗-なるほどうすつくら"   => "なる|ほど|うすつ|くら"  , # い
    "出來不出來-できふでき"         => "で|き|ふ|で|き"         , # が
    "十年二十年-じうねんにじうねん" => "じう|ねん|に|じう|ねん" , # の
  }
  abort = 0
  hh.each{ | key, val |
    aa = key.gsub(/-.*/, "").size
    bb = val.gsub(/[^|]/, "").size + 1
    unless aa == bb then
      abort = abort + 1
      printf "k %d <%s> / v %d <%s>\n", aa, key, bb, val
    end
  }
  if abort > 0 then
    printf "ハッシュテーブルを修正して再挑戦\n"
    exit
  end
}

reg = [
  "[{]"           ,
  "(\\p{han}+)"   , # mm[1]
  "[}][{]"        ,
  "(["            , # mm[2]
  "\\p{hiragana}" , # mm[2]
  "\\p{katakana}" , # mm[2]
  "[:blank:]"     , # mm[2]
  "〳〵"          , # mm[2]
  "]+)"           , # mm[2]
  "[}]"           ,
  "(.*)"          , # mm[3]
].join()

mm = $F[1].match(reg)
if mm ; then
  kk = [ mm[1], mm[2] ].join("-")
  if hh.key?(kk) ; then
    printf "%s\t%s\t%s\t%s\n",$F[0], mm[1], mm[2], hh[kk]
  else
    if abort == 0 then
      STDERR.printf "以下の情報をハッシュテーブルに登録して再挑戦\n"
    end
    abort = abort + 1
    STDERR.printf "\t\"%s\"\t=> \"%s\", # %s\n", kk, mm[2], mm[3]
  end

end


##$_.gsub(/\[g\]([{]$kanji[}])[{]$old[}]/, '\1{$new}')
##
##        $_.gsub(/\[g\]([{]$kanji[}])[{]$old[}]/, '\1{$new})'
##
